In [1]:
    import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
d= {
 "name" : ['abhi','avi','raj'], 
 "marks" :[92,86,74],
 "city" :['sasaram','patna','ranchi']
}

In [4]:
df=pd.DataFrame(d)

In [5]:
df

   name  marks     city
0  abhi     92  sasaram
1   avi     86    patna
2   raj     74   ranchi

In [6]:
df.to_csv("friend.csv")

In [7]:
df.head(2)

   name  marks     city
0  abhi     92  sasaram
1   avi     86    patna

In [8]:
df.tail(1)

  name  marks    city
2  raj     74  ranchi

In [9]:
df.describe()

           marks
count   3.000000
mean   84.000000
std     9.165151
min    74.000000
25%    80.000000
50%    86.000000
75%    89.000000
max    92.000000

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
list(df.columns)

['name', 'marks', 'city']

In [12]:
df['marks']

0    92
1    86
2    74
Name: marks, dtype: int64

In [13]:
type(df['marks'])

pandas.core.series.Series

In [14]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [15]:
d1= {
   "name" : ['abhi','avi','raj','rahul','ravi' ,'rohan'],
   "marks" :[4,8,15,16,23,42],
   "city" :['sasaram','patna','ranchi','delhi','bombay','pune']
}

In [16]:
df=pd.DataFrame(d1)

In [17]:
df

    name  marks     city
0   abhi      4  sasaram
1    avi      8    patna
2    raj     15   ranchi
3  rahul     16    delhi
4   ravi     23   bombay
5  rohan     42     pune

In [18]:
df['marks']

0     4
1     8
2    15
3    16
4    23
5    42
Name: marks, dtype: int64

In [19]:
type(df['marks'])

pandas.core.series.Series

In [20]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas. Series function on the variable print it.

In [21]:
d3= {
   "name": ['abhi','avi','raj','rahul','ravi','rohit','virat','dhoni','rahul','pant'],
   "score": [12,20,30,45,56,45,47,31,100,95],
   "state": ['br','br','jh','up','wb','mh','dl','tl','dl','rj'],
   "phone no ":[7894561230,7418529630,8527419630,987654326,8456123785,6213456789,8797456124,7578945613,7894531648,8877994455],
   "email id" :['abhi@gmail.com','abhi1@gmail.com','abhi2@gmail.com','abh3i@gmail.com','abhi4@gmail.com','abhi5@gmail.com','abhi6@gmail.com','abhi7@gmail.com','abhi8@gmail.com','abhi9@gmail.com'],
   "sport":[ 'cr','ft','cr','ft','cr','ft','cr','ft','cr','ft',],
   "wage":[100,450,536,5446,890,9000000,800000,7852366,796466,4567512],
   "age":[25,26,27,28,29,38,35,36,28,26],
   "religon":['hindu','hindu','hindu','hindu','hindu','hindu','hindu','hindu','hindu','hindu'],
   "gender":['male','male','male','male','male','male','male','male','male','male'],
    
}

In [22]:
df=pd.DataFrame(d3)

In [23]:
df

,name,score,state,phone no,email id,sport,wage,age,religon,gender
0,abhi,12,br,7894561230,abhi@gmail.com,cr,100,25,hindu,male
1,avi,20,br,7418529630,abhi1@gmail.com,ft,450,26,hindu,male
2,raj,30,jh,8527419630,abhi2@gmail.com,cr,536,27,hindu,male
3,rahul,45,up,987654326,abh3i@gmail.com,ft,5446,28,hindu,male
4,ravi,56,wb,8456123785,abhi4@gmail.com,cr,890,29,hindu,male
5,rohit,45,mh,6213456789,abhi5@gmail.com,ft,9000000,38,hindu,male
6,virat,47,dl,8797456124,abhi6@gmail.com,cr,800000,35,hindu,male
7,dhoni,31,tl,7578945613,abhi7@gmail.com,ft,7852366,36,hindu,male
8,rahul,100,dl,7894531648,abhi8@gmail.com,cr,796466,28,hindu,male
9,pant,95,rj,8877994455,abhi9@gmail.com,ft,4567512,26,hindu,male

In [24]:
#Q3. Create a Pandas DataFrame that contains the following data:

In [25]:
d4= {
   "name": ['Alice','Bob','Claire'],
     "age":[25,30,27],
    "gender":['female','male','female'],
    
}

In [26]:
df=pd.DataFrame(d4)

In [27]:
df

     name  age  gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

In [28]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [29]:
#A DataFrame in pandas is a 2-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or SQL table. It can be thought of as a collection of Series objects that share the same index.

#On the other hand, a pandas Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating-point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. A Series can be seen as a column in a DataFrame.

#Here's an example

# creating a dictionary to form a dataframe
data = {
    'Name': ['Abhi', 'avi', 'rahul', 'raj'],
    'Age': [25, 30, 35, 40],
    'Salary': [50000, 60000, 70000, 80000]
       }
df=pd.DataFrame(data)
#We then create a  We can see that the DataFrame has three columns and four rows, while the Series has only one column and four rows.

In [30]:
df

    Name  Age  Salary
0   Abhi   25   50000
1    avi   30   60000
2  rahul   35   70000
3    raj   40   80000

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
type(df['Name'])

pandas.core.series.Series

In [33]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [34]:
#Pandas provides a wide range of functions for manipulating data in a DataFrame. Here are some common functions:

#head() and tail(): These functions are used to view the first or last few rows of the DataFrame. For example, df.head() will display the first 5 rows of the DataFrame df.

#describe(): This function provides a statistical summary of the DataFrame, including count, mean, standard deviation, minimum, and maximum values, as well as quartiles. For example, df.describe() will display the statistical summary of the DataFrame df.

#sort_values(): This function is used to sort the DataFrame by one or more columns. For example, df.sort_values('score') will sort the DataFrame df by the 'score' column in ascending order.

#These are just a few examples of the many functions available in Pandas for manipulating data in a DataFrame.
df

    Name  Age  Salary
0   Abhi   25   50000
1    avi   30   60000
2  rahul   35   70000
3    raj   40   80000

In [35]:
df.head()

    Name  Age  Salary
0   Abhi   25   50000
1    avi   30   60000
2  rahul   35   70000
3    raj   40   80000

In [36]:
df.tail(2)

    Name  Age  Salary
2  rahul   35   70000
3    raj   40   80000

In [37]:
df.describe()

             Age        Salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

In [38]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


#Of the three data structures, both DataFrame and Panel are mutable in nature, while Series is immutable.
#Once created, the values in a Series cannot be changed. In contrast, both DataFrame and Panel can be modified, for example, by adding, deleting or modifying rows or columns.

In [39]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [50]:

    # Define the first series
name = pd.Series(['Abhi', 'harsh', 'jayesh', 'kausal', 'krishna'])
    # Define the second series
age = pd.Series([25, 18, 7, 19, 38])
    # Define the third series
city = pd.Series(['Nasik', 'Shmila', 'Locknow', 'Calcatta', 'Bombay'])

    # Combine the series into a DataFrame
df = pd.DataFrame({'Name': name, 'Age': age, 'City': city})

In [51]:
df

      Name  Age      City
0     Abhi   25     Nasik
1    harsh   18    Shmila
2   jayesh    7   Locknow
3   kausal   19  Calcatta
4  krishna   38    Bombay